Public Attributes | List of all members
API_RailingRailQuantity Struct Reference
Element Manager
Calculated values for the rails of the railing. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
Volume of the given rail.
 double  | length3D
Length of the 3D reference line of the given rail.
Detailed Description
Calculated values for the rails of the railing.